Revit 2027 API
IFCUserDefinedPropertySet.ListPropertySetNames Method
 Returns a list property set names stored in the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<string> ListPropertySetNames(
	Document document
)
Public Shared Function ListPropertySetNames (
	document As Document
) As IList(Of String)
public:
static IList<String^>^ ListPropertySetNames(
	Document^ document
)
static member ListPropertySetNames :
        document : Document -> IList<string>
Parameters
document Document
 The Revit document to retrieve names from.
Return Value
IList<String>
 The list of property set names.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCUserDefinedPropertySet Class
Autodesk.Revit.DB Namespace